#include <iostream>
#include <cstring>
using namespace std;

int main()
{
	int t;
	cin >> t;

	int s = 0;
	if(t<=3500)		//税点以下
		s = t;
	else
	{
		s += 3500;	//增加已解出的值
		t -= 3500;	//减去已解出的值
		if(t<=1500 * 0.97)			//一级税点
			s += t/0.97;
		else
		{
			s += 1500;			//增加已解出的值
			t -= 1500 * 0.97;	//减去已解出的值
			if(t<=3000*0.9)			//二级税点
				s += t/0.9;
			else
			{
				s += 3000;
				t -= 3000 * 0.9;
				if(t<=4500*0.8)		//三级税点
					s += t/0.8;
				else
				{
					s += 4500;
					t -= 4500 * 0.8;
					if(t<=26000*0.75)	//四级税点
						s += t/0.75;
					else
					{
						s += 26000;
						t -= 26000*0.75;
						if(t<=20000*0.7)	//五级税点
							s += t/0.7;
						else
						{
							s += 20000;
							t -= 20000 * 0.7;
							if(t<=25000*0.65)	//六级税点
								s += t/0.65;
							else
							{
								s += 25000;
								t -= 25000*0.65;
								s += t/0.55;	//七级税点
							}
						}
					}
				}
			}
		}
	}
	cout << s << endl;
	return 0;
}